build/classes/Entrega dos Final/docs/Pruebas de Carga/exp2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de Pruebas" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo de Hilos" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">300000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <longProp name="ThreadGroup.start_time">1525999947000</longProp>
        <longProp name="ThreadGroup.end_time">1525999947000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Gestor de Cabecera HTTP" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6Ik1UUXdNamMyT1RnelJqSXhSVVV3UWpVeU9UZzFSa1ZCT1RjMFFrWXpNRUpDUmpCR05UQTNNZyJ9.eyJpc3MiOiJodHRwczovL2lzaXMyNTAzLWRhc29sYW5vMS5hdXRoMC5jb20vIiwic3ViIjoiYXV0aDB8NWFlNGMyMDlmMjRlODgyMWM0ZGE2M2U4IiwiYXVkIjpbInVuaWFuZGVzLmVkdS5jby9lbnRyZWdhMiIsImh0dHBzOi8vaXNpczI1MDMtZGFzb2xhbm8xLmF1dGgwLmNvbS91c2VyaW5mbyJdLCJpYXQiOjE1MjYwNDIxODEsImV4cCI6MTUyNjEyODU4MSwiYXpwIjoicjBmZlU5Y2NjVXZrVjk4V0M1T0ItSHRWamJzYk56X0YiLCJzY29wZSI6Im9wZW5pZCBwcm9maWxlIGVtYWlsIGFkZHJlc3MgcGhvbmUiLCJndHkiOiJwYXNzd29yZCJ9.v7qIwrPVkHHa_w6fm3WV4caMzCiBBoPtz9qQkjWKiXNMn_BkV0rv7LyZ7ma0fNnboZHRz1MlMHyHn1_e1EyYxHHhO01kDklZk0P-1paczqFoPdk5khTYbcL-4TzS9zdb-ADfSu7Z_LXMIE-W4-35zEEBsvsjLSci9020oPFsojLZSefnHDpnuyXDEiNq-_K2jh-nY1xOLbvLQebq8MnP5mLsn39pgLVYumdRAPSOfKpu8dDJZ3Nc7J0_JhguEsI4y3z1P0RYk_mxwuU_68XzdD5kjCtoO0t88crC3hRY44Nq3K2l6jT_asAnHIcqmd_z1mySdCz0HJUKD5lNipdIbg</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Petición HTTP" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{     &quot;Activo&quot;: &quot;true&quot;,      &quot;Tipo&quot;: &quot;A1. Puerta Abierta&quot;,     &quot;Conjunto&quot;:&quot;Mirandela&quot;,     &quot;Torre&quot;:&quot;1&quot;,     &quot;Piso&quot;:&quot;1&quot;,     &quot;Apartamento&quot;:&quot;1&quot; }</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">5000</stringProp>
          <stringProp name="HTTPSampler.path">http://127.0.0.1:5000/alertas</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Árbol de Resultados" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
